// 我々は普通3次元空間があると考えています
// 4次元目は普通は時間です
// しかしカスタマイズマシン教会(ACM)は、
// 彼らの奇妙な顧客(EE3)のため、
// 4次元空間に取り組まなければなりません
// EE3の製品は4次元です
// それを天の川銀河のはずれにある新興市場に出荷するため、
// 垂直な平行六面体の中に4次元の製品を梱包しなければなりません
// EE3の製品はたくさんの4Dキューブから成っており、
// それらの4Dキューブの顔はくっついています
// 4Dキューブには8つの顔があり、顔は3Dキューブです
//
// 左の絵は、4つの主要な直行する軸を持つ平面に投影された4Dキューブを説明しています
// その投影で4Dキューブの顔を理解するには、
// 少しだけ想像力をストレッチさせる努力が必要です
// 
// 下の絵は、4つの軸に沿った2つの顔がどのように、
// 4Dの中に位置しているかを説明していますが、
// これを平面投影だけで説明するのは容易ではなく、
// 理解するには再び努力が必要です
//
// しかし良い仕事をしていると思いませんか?
// 梱包されるEE3の製品はたくさんの4Dキューブから成っており、
// 4Dキューブの顔は3Dキューブであり、
// それぞれの4Dキューブはその顔に沿ってくっついています
//
// 貴方の仕事は単純です
// 出荷前に製品を梱包するために必要な最小の垂直平行六面体の大きさを探してください
// 大きさは4Dキューブの数で測定されます
//
// 入力
//
// 最初の行はテストケース数です
// その後に各テストケースが続きます
//
// テストケースの最初の行は、製品に使われる4Dキューブの個数です
// 次に、1つのキューブを説明する、9つの非負な整数値を含んだ行が、n行だけあります
// 最初の値は正の整数で、これはキューブのユニークな識別子です
// 残りの8つの値は、隣接するキューブの識別子のリストで、その順序は以下の通りです
//
// 初めの2つは、
