// 1からkまでの正の整数を並べた数列をSkとする
// S1=1
// S2=12
// S3=123
// Sk=12...k
// S1S2S3...Sk=112123...12...k
// 正の整数iが与えられたとき、S1S2...Skのi番目に位置する数字を見つけよ
// 
// k 12 3  4   5    6     7      8       9        10
//   11212312341234512345612345671234567812345678912345678910...
// i 12345678901234567890123456789012345678901234567890123456...
//            1         2         3         4         5
// 入力
//
// 最初の行はテストケース数t(ただし1<=t<=10)、後にテストケースの行が続く
// テストケースは1行で1つの整数i(ただし1<=i<=2147483647)を含む
//
// 出力
//
// iに位置する数字

#include <stdio.h>

int main()
{
	int t,i,k,l,m,n,o,p,ans;
	for (scanf("%d", &t); t; t--) {
		scanf("%d", &i);
		for (k=1; i>0; k++) {
			for (l=10,m=1; k>=l/10&&i>0; l*=10,m++) {
				if (k < l)
					n = m*(k+1-l/10); //k=10なら10未満の1桁の数が9文字と、10以上の2桁の数が10文字
				else
					n = m*9*(l/10);
//				printf("k=%d l=%d n=%d i=%d\n", k, l, n, i);
				if (i > n)
					i -= n;
				else {
					o = (l==10)?i:(i-1)/m+l/10;
					i = (i%m==0)?m:i%m;
					for (p=l/10; p; p/=10) {
						ans = o/p;
						o -= ans*p;
						if (--i==0)
							break;
					}
					printf("%d\n", ans);
				}
			}
		}
	}
}
